7zip
a52dec
aalib
abseil-cpp
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
ananicy-cpp
aom
appstream
aquamarine
archlinux-keyring
archlinux-xdg-menu
aria2
aribb24
aribb25
ark
at-spi2-core
atkmm
attica
attr
audit
autoconf
automake
avahi
ayatana-ido
baloo
baloo-widgets
banner
base
base-devel
bash
binutils
bison
blueman
bluez
bluez-libs
bluez-utils
boost-libs
botan
brave-bin
breeze
breeze-gtk
breeze-icons
breeze5
brightnessctl
brltty
brotli
btop
btrfs-assistant
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
caffeine-ng
cairo
cairomm
cairomm-1.16
capstone
cdparanoia
chromaprint
cifs-utils
cliphist
cmake
confuse
convertlit
coreutils
cowsay
cpio
cppdap
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
djvulibre
dmidecode
dnsmasq
dolphin
dolphin-plugins
dosfstools
double-conversion
doxx
dtc
duktape
dunst
e2fsprogs
ebook-tools
editorconfig-core-c
edk2-aarch64
edk2-arm
edk2-ovmf
efibootmgr
efivar
exfatprogs
exiv2
expat
eza
faac
faad2
fakeroot
fastfetch
ffmpeg
ffmpeg4.4
fftw
file
filesystem
findutils
flac
flex
fluidsynth
fmt
fontconfig
fortune-mod
frameworkintegration
frameworkintegration5
freeglut
freetype2
fribidi
ftgl
fuse-common
fuse2
fuse3
fzf
gawk
gc
gcc
gcc-libs
gcr
gcr-4
gdbm
gdk-pixbuf2
geoclue
geocode-glib-2
geocode-glib-common
gettext
gfxstream
giflib
girara
git
glew
glib-networking
glib2
glib2-devel
glibc
glibmm
glibmm-2.68
glm
glslang
glu
glusterfs
glycin
gmp
gnome-clocks
gnome-desktop-4
gnome-desktop-common
gnome-keyring
gnulib-l10n
gnupg
gnutls
gobject-introspection-runtime
gperftools
gpgme
gpgmepp
gpm
gpsd
granite7
graphene
graphite
grep
grim
groff
grub
grub-btrfs
gsettings-desktop-schemas
gsettings-system-schemas
gsm
gssdp
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk-vnc
gtk3
gtk4
gtk4-layer-shell
gtkmm-4.0
gtkmm3
gtksourceview4
guile
gumbo-parser
gupnp
gupnp-igd
gvfs
gzip
harfbuzz
hicolor-icon-theme
hidapi
highway
hunspell
hwdata
hyprcursor
hyprgraphics
hypridle
hyprland
hyprland-guiutils
hyprlang
hyprlock
hyprpaper
hyprpicker
hyprshot
hyprsunset
hyprtoolkit
hyprutils
hyprwayland-scanner
iana-etc
icu
imagemagick
imath
imlib2
iniparser
inotify-tools
intel-ucode
iproute2
iptables-nft
iputils
iso-codes
jansson
java-environment-common
java-runtime-common
jbig2dec
jbigkit
jdk-openjdk
jq
json-c
json-glib
jsoncpp
karchive
karchive5
kauth
kauth5
kbd
kbookmarks
kcmutils
kcodecs
kcodecs5
kcolorscheme
kcompletion
kconfig
kconfig5
kconfigwidgets
kconfigwidgets5
kcoreaddons
kcoreaddons5
kcrash
kdbusaddons
kde-cli-tools
kdecoration
kdesu
kdnssd
kdsoap-qt6
kdsoap-ws-discovery-client
keyutils
kfilemetadata
kglobalaccel
kguiaddons
kguiaddons5
ki18n
ki18n5
kiconthemes
kiconthemes5
kidletime
kio
kio-admin
kio-extras
kirigami
kirigami2
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmod
knewstuff
knotifications
knotifications5
kpackage
kparts
kpmcore
kpty
krb5
kservice
ktexteditor
ktextwidgets
kuserfeedback
kwallet
kwidgetsaddons
kwidgetsaddons5
kwindowsystem
kwindowsystem5
kxmlgui
l-smash
lame
lcms2
ldb
leancrypto
legacy-launcher
leptonica
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-attr
lib32-audit
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-harfbuzz
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libnm
lib32-libnsl
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-openssl
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vulkan-icd-loader
lib32-vulkan-intel
lib32-vulkan-mesa-device-select
lib32-vulkan-radeon
lib32-wayland
lib32-xcb-util-keysyms
lib32-xz
lib32-zlib
lib32-zstd
libadwaita
libaemu
libaio
libappindicator
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libavtp
libayatana-appindicator
libayatana-indicator
libb2
libb64
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libburn
libbytesize
libcaca
libcacard
libcanberra
libcap
libcap-ng
libcbor
libcddb
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdv
libdvbpsi
libdvdcss
libdvdnav
libdvdread
libebml
libebur128
libedit
libei
libelf
libepoxy
libevdev
libevent
libfdk-aac
libffi
libfontenc
libfreeaptx
libftdi
libfyaml
libgcrypt
libgee
libgirepository
libgit2
libglvnd
libgme
libgoom2
libgovirt
libgpg-error
libgudev
libgweather-4
libice
libidn2
libiec61883
libimobiledevice
libimobiledevice-glue
libindicator
libinih
libinput
libiscsi
libisl
libisoburn
libisofs
libjpeg-turbo
libjxl
libkate
libkexiv2
libksba
liblc3
libldac
libldap
libliftoff
liblouis
liblqr
liblrdf
libltc
libluv
libmad
libmatroska
libmd
libmfx
libmicrodns
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspack
libmtp
libmupdf
libmysofa
libnatpmp
libnbd
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnvme
libogg
liboggz
libopenmpt
libosinfo
libp11-kit
libpcap
libpciaccess
libpgm
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqalculate
libraqm
libraw1394
librest
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsigc++
libsigc++-3.0
libsixel
libslirp
libsm
libsndfile
libsodium
libsoup3
libsoxr
libspeechd
libsrtp
libssh
libssh2
libstemmer
libsynctex
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtiger
libtirpc
libtommath
libtool
libtorrent-rasterbar
libtraceevent
libtracefs
libunibreak
libunistring
libunwind
libupnp
liburcu
liburing
libusb
libusb-compat
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libverto
libvirt
libvirt-glib
libvirt-python
libvlc
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxdp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
lirc
live-media
llhttp
llvm-libs
lm_sensors
lmdb
localsend-bin
lolcat
lsb-release
lsof
lua
lua51-lpeg
lua52
lua52-bit32
lua52-posix
lua52-socket
luajit
lv2
ly
lz4
lzo
m4
mailcap
make
mangowc-git
md4c
mdadm
media-player-info
mesa
meson
micro
minecraft-launcher-debug
miniupnpc
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpdecimal
mpfr
mpg123
mpv
mpv-mpris
mpv-notify-git
msgpack-c
mtdev
mujs
multipath-tools
nano
ncdu
ncurses
ndctl
neon
neovim
nettle
network-manager-applet
networkmanager
networkmanager-dmenu-git
nftables
ninja
nm-connection-editor
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-emoji
npm
npth
nspr
nss
ntfs-3g
numactl
nwg-look
ocl-icd
oniguruma
openal
opencore-amr
openexr
openh264
openjpeg2
openssh
openssl
opus
orc
os-prober
osinfo-db
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pamixer
pango
pangomm
pangomm-2.48
papirus-icon-theme
parted
partitionmanager
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
phodav
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
plasma-activities
playerctl
polkit
polkit-kde-agent
polkit-qt5
polkit-qt6
poppler
poppler-qt6
popt
portaudio
powertop
pps-tools
preload
procps-ng
projectm
protobuf
psmisc
pugixml
python
python-argcomplete
python-attrs
python-autocommand
python-brotli
python-cairo
python-certifi
python-cffi
python-charset-normalizer
python-click
python-cryptography
python-dbus
python-distlib
python-distro
python-docopt
python-ewmh
python-feedparser
python-filelock
python-gobject
python-idna
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-keyutils
python-lxml
python-markdown
python-more-itertools
python-mutagen
python-packaging
python-pip
python-pipx
python-platformdirs
python-pulsectl
python-pycparser
python-pycryptodomex
python-pygments
python-pyxattr
python-pyxdg
python-requests
python-setproctitle
python-setuptools
python-sgmllib3k
python-six
python-tqdm
python-urllib3
python-userpath
python-virtualenv
python-websockets
python-wheel
python-wxpython
python-xlib
python-yaml
qalculate-gtk
qbittorrent
qca-qt6
qemu-audio-alsa
qemu-audio-dbus
qemu-audio-jack
qemu-audio-oss
qemu-audio-pa
qemu-audio-pipewire
qemu-audio-sdl
qemu-audio-spice
qemu-base
qemu-block-curl
qemu-block-dmg
qemu-block-gluster
qemu-block-iscsi
qemu-block-nfs
qemu-block-ssh
qemu-chardev-baum
qemu-chardev-spice
qemu-common
qemu-desktop
qemu-docs
qemu-emulators-full
qemu-full
qemu-hw-display-qxl
qemu-hw-display-virtio-gpu
qemu-hw-display-virtio-gpu-gl
qemu-hw-display-virtio-gpu-pci
qemu-hw-display-virtio-gpu-pci-gl
qemu-hw-display-virtio-gpu-pci-rutabaga
qemu-hw-display-virtio-gpu-rutabaga
qemu-hw-display-virtio-vga
qemu-hw-display-virtio-vga-gl
qemu-hw-display-virtio-vga-rutabaga
qemu-hw-s390x-virtio-gpu-ccw
qemu-hw-uefi-vars
qemu-hw-usb-host
qemu-hw-usb-redirect
qemu-hw-usb-smartcard
qemu-img
qemu-pr-helper
qemu-system-aarch64
qemu-system-alpha
qemu-system-alpha-firmware
qemu-system-arm
qemu-system-arm-firmware
qemu-system-avr
qemu-system-hppa
qemu-system-hppa-firmware
qemu-system-loongarch64
qemu-system-m68k
qemu-system-microblaze
qemu-system-microblaze-firmware
qemu-system-mips
qemu-system-or1k
qemu-system-ppc
qemu-system-ppc-firmware
qemu-system-riscv
qemu-system-riscv-firmware
qemu-system-rx
qemu-system-s390x
qemu-system-s390x-firmware
qemu-system-sh4
qemu-system-sparc
qemu-system-sparc-firmware
qemu-system-tricore
qemu-system-x86
qemu-system-x86-firmware
qemu-system-xtensa
qemu-tests
qemu-tools
qemu-ui-curses
qemu-ui-dbus
qemu-ui-egl-headless
qemu-ui-gtk
qemu-ui-opengl
qemu-ui-sdl
qemu-ui-spice-app
qemu-ui-spice-core
qemu-user
qemu-vhost-user-gpu
qemu-vmsr-helper
qqc2-desktop-style
qqc2-desktop-style5
qrencode
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-multimedia
qt5-quickcontrols
qt5-quickcontrols2
qt5-speech
qt5-svg
qt5-translations
qt5-wayland
qt5-x11extras
qt5ct-kde
qt6-5compat
qt6-base
qt6-declarative
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-shadertools
qt6-speech
qt6-svg
qt6-translations
qt6-wayland
qt6ct-kde
quodlibet
qview
raptor
rav1e
rdma-core
re2
readline
recode
rhash
ripgrep
ripgrep-all
rofi
rofi-emoji
rofi-power-menu
rpcbind
rsync
rtkit
rtmpdump
rubberband
ruby
ruby-erb
ruby-manpages
ruby-optimist
ruby-paint
ruby-rdoc
rubygems
rutabaga-ffi
sbc
scdoc
scenefx0.4
sct-debug
sdbus-cpp
sdl12-compat
sdl2-compat
sdl2_image
sdl3
sdl_image
seabios
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
simdjson
slang
slurp
smartmontools
smbclient
snap-pac
snapper
snappy
sndio
sof-firmware
solid
sonnet
sonnet5
sord
sound-theme-freedesktop
soundtouch
spandsp
spdlog
speex
speexdsp
spice
spice-gtk
spice-protocol
spirv-tools
sqlite
sratom
srt
startup-notification
steam
stow
sudo
svt-av1
svt-hevc
swaybg
swaync
syndication
syntax-highlighting
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tdb
tesseract
tesseract-data-afr
tesseract-data-osd
tevent
texinfo
thunderbird
tinysparql
tomlplusplus
tpm2-tss
traceroute
transmission-cli
tree
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-dejavu
ttf-droid
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
ttf-opensans
ttf-roboto
twolame
tzdata
uchardet
udiskie
udisks2
unibilium
unrar
unzip
upower
usbredir
usbutils
util-linux
util-linux-libs
v4l-utils
vapoursynth
vde2
vid.stab
video-downloader
virglrenderer
virt-install
virt-manager
virt-viewer
virtiofsd
visual-studio-code-bin
vlc
vlc-cli
vlc-gui-qt
vlc-plugin-a52dec
vlc-plugin-aalib
vlc-plugin-alsa
vlc-plugin-aom
vlc-plugin-archive
vlc-plugin-aribb24
vlc-plugin-aribb25
vlc-plugin-ass
vlc-plugin-avahi
vlc-plugin-bluray
vlc-plugin-caca
vlc-plugin-cddb
vlc-plugin-chromecast
vlc-plugin-dav1d
vlc-plugin-dbus
vlc-plugin-dbus-screensaver
vlc-plugin-dca
vlc-plugin-dvb
vlc-plugin-dvd
vlc-plugin-faad2
vlc-plugin-ffmpeg
vlc-plugin-firewire
vlc-plugin-flac
vlc-plugin-fluidsynth
vlc-plugin-freetype
vlc-plugin-gme
vlc-plugin-gnutls
vlc-plugin-gstreamer
vlc-plugin-inflate
vlc-plugin-jack
vlc-plugin-journal
vlc-plugin-jpeg
vlc-plugin-kate
vlc-plugin-kwallet
vlc-plugin-libsecret
vlc-plugin-lirc
vlc-plugin-live555
vlc-plugin-lua
vlc-plugin-mad
vlc-plugin-matroska
vlc-plugin-mdns
vlc-plugin-modplug
vlc-plugin-mpeg2
vlc-plugin-mpg123
vlc-plugin-mtp
vlc-plugin-musepack
vlc-plugin-nfs
vlc-plugin-notify
vlc-plugin-ogg
vlc-plugin-opus
vlc-plugin-png
vlc-plugin-pulse
vlc-plugin-quicksync
vlc-plugin-samplerate
vlc-plugin-sdl
vlc-plugin-sftp
vlc-plugin-shout
vlc-plugin-smb
vlc-plugin-soxr
vlc-plugin-speex
vlc-plugin-srt
vlc-plugin-svg
vlc-plugin-tag
vlc-plugin-theora
vlc-plugin-twolame
vlc-plugin-udev
vlc-plugin-upnp
vlc-plugin-vorbis
vlc-plugin-vpx
vlc-plugin-x264
vlc-plugin-x265
vlc-plugin-xml
vlc-plugin-zvbi
vlc-plugins-all
vlc-plugins-base
vlc-plugins-extra
vlc-plugins-video-output
vlc-plugins-visualization
vmaf
volume_key
vte-common
vte3
vulkan-icd-loader
vulkan-intel
vulkan-mesa-device-select
vulkan-radeon
vulkan-tools
wavpack
waybar
wayland
wayland-protocols
webrtc-audio-processing-1
wget
which
wildmidi
wireplumber
wl-clipboard
wlr-dpms-git
wlr-dpms-git-debug
wlrctl
wlrctl-debug
wlroots0.19
wlsunset
woff2-font-awesome
wolfssl
wpa_supplicant
wtype
wxwidgets-common
wxwidgets-gtk3
x264
x265
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcur2png
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xkeyboard-config
xorg-fonts-encodings
xorg-server-common
xorg-setxkbmap
xorg-xkbcomp
xorg-xprop
xorg-xrandr
xorg-xset
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yay
yazi
yt-dlp
yyjson
zathura
zathura-pdf-mupdf
zbar
zenity
zeromq
zimg
zix
zlib
zlib-ng
zram-generator
zsh
zstd
zvbi
zxing-cpp
