alsa-utils
ananicy-cpp
archlinux-xdg-menu
aria2
ark
banner
base
base-devel
blueman
bluez-utils
brave-bin
breeze
breeze-gtk
breeze5
brightnessctl
btop
btrfs-assistant
btrfs-progs
caffeine-ng
cliphist
dmidecode
dolphin
dolphin-plugins
dosfstools
doxx
dunst
efibootmgr
exfatprogs
eza
fastfetch
ffmpeg
fzf
git
gnome-boxes
gnome-clocks
gnome-keyring
grub
grub-btrfs
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-base
gst-plugins-good
gst-plugins-ugly
gvfs
hyprcursor
hypridle
hyprland
hyprlock
hyprpaper
hyprpicker
hyprshot
hyprsunset
inotify-tools
intel-ucode
kde-cli-tools
kio-admin
kitty
less
libdvdcss
libmad
libpulse
linux
linux-firmware
ly
micro
mpv
nano
ncdu
network-manager-applet
networkmanager
networkmanager-dmenu-git
noto-fonts
noto-fonts-emoji
ntfs-3g
nwg-look
os-prober
pacman-contrib
pamixer
papirus-icon-theme
partitionmanager
pavucontrol
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
polkit-kde-agent
powertop
preload
python-pip
python-pipx
qalculate-gtk
qbittorrent
qt5-wayland
qt5ct-kde
qt6-wayland
qt6ct-kde
quodlibet
qview
rofi
rofi-emoji
rofi-power-menu
rsync
snap-pac
snapper
sof-firmware
steam
swaync
thunderbird
traceroute
transmission-cli
tree
ttf-droid
ttf-jetbrains-mono-nerd
ttf-opensans
ttf-roboto
udiskie
unrar
video-downloader
visual-studio-code-bin
vlc
vlc-plugins-all
waybar
wget
wine
wine-gecko
wine-mono
winetricks
wireplumber
wlsunset
woff2-font-awesome
wtype
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-user-dirs-gtk
yay
yazi
zathura
zathura-pdf-mupdf
zram-generator
zsh
